[{"id":"DTE0001","name":"Admin Access","description":"Modify a user's administrative privileges.\n","long_description":"Changing the target system to allow or disallow users to perform tasks requiring administrator level permissions gives the defender leverage in inhibiting or facilitating attacks.  The procedures for changing these permissions vary across different operating and software systems."},{"id":"DTE0003","name":"API Monitoring","description":"Monitor local APIs that might be used by adversary tools and activity.","long_description":"API Monitoring involves capturing an internal Operating System (OS) function for its usage, accompanying arguments, and result. When a defender captures this information, the intelligence gathered can be analyzed to gain insight into the activity of an adversary at a level deeper than normal system activity monitoring."},{"id":"DTE0004","name":"Application Diversity","description":"Present the adversary with a variety of installed applications and services.","long_description":"Application diversity is presenting multiple software targets to the adversary. On a single target system, defenders can configure multiple different services or user software applications.  On a target network, defenders can present systems with a variety of operating systems, operating system versions, applications, and services."},{"id":"DTE0005","name":"Backup and Recovery","description":"Make copies of key system software, configuration, and data to enable rapid system restoration.","long_description":"Employ disk imaging, system backup, or file synchronization tools to create copies of key data on a protected backup repository.  This is typically done to capture/restore an entire system or major subsystems."},{"id":"DTE0006","name":"Baseline","description":"Identify key system elements to establish a baseline and be prepared to reset a system to that baseline when necessary.","long_description":"Identify elements of software and configuration critical to a set of objectives, define their proper values, and be prepared to reset a running system to its intended state.  "},{"id":"DTE0007","name":"Behavioral Analytics","description":"Deploy tools that detect unusual system or user behavior.\n","long_description":"Instrument a system to collect detailed information about process execution and user activity, develop a sense of normal or expected behaviors, and alert on abnormal or unexpected activity.  This can be accomplished either onboard the target system or by shipping data to a centralized analysis and alerting system."},{"id":"DTE0008","name":"Burn-In","description":"Exercise a target system in a manner where it will generate desirable system artifacts.\n","long_description":"Exercising the system to create desirable system artifacts including web browsing, filesystem usage, running user applications like office suites, etc.  The burn-in process can be specific to a user or system, depending on your needs."},{"id":"DTE0010","name":"Decoy Account","description":"Create an account that is used for active defense purposes.","long_description":"A decoy account is one that is created specifically for defensive or deceptive purposes. It can be in the form of user accounts, service accounts, software accounts, etc. The decoy account can be used to make a system, service, or software look more realistic or to entice an action."},{"id":"DTE0011","name":"Decoy Content ","description":"Seed content that can be used to lead an adversary in a specific direction, entice a behavior, etc.","long_description":"Decoy Content is the data used to tell a story to an adversary. This content can be legitimate or synthetic data which is used to reinforce or validate your defensive strategy. Examples of decoy content are files on a storage object, entries in the system registry, system shortcuts, etc."},{"id":"DTE0012","name":"Decoy Credentials","description":"Create user credentials that are used for active defense purposes.","long_description":"Seed a target system with credentials (such as username/password, browser tokens, and other forms of authentication data) for the purpose of engagement. Decoy credentials can be planted in many locations and leveraged in a variety of ways."},{"id":"DTE0013","name":"Decoy Diversity","description":"Deploy a set of decoy systems with different OS and software configurations.","long_description":"Decoy diversity is the deployment of decoy systems with varying Operating Systems and software configurations. Most enterprise networks contain systems which utilize different types and versions of operating systems and applications (Microsoft Windows, MacOS, Linux, Microsoft Office, Adobe Reader, etc.)  Deploying decoy systems with such variations allows you to present a realistic environment to an adversary.  It also allows you to see if they use different TTPs on systems with different configurations."},{"id":"DTE0014","name":"Decoy Network","description":"Create a target network with a set of target systems, for the purpose of active defense.\n","long_description":"Decoy networks are comprised of multiple computing resources that can be used for defensive or deceptive purposes.  A decoy network can be used to safely perform dynamic analysis of suspected malicious code. A defender can also use a specially crafted decoy network to perform adversary engagement. "},{"id":"DTE0015","name":"Decoy Persona","description":"Develop personal information (aka a backstory) about a user and plant data to support that backstory.\n","long_description":"A decoy persona is used to establish background information about a user.  In order to have the adversary believe they are operating against real targets (people and IT), develop a backstory about a user and plant data to support that backstory.  Depending on the need for realism, the constructed persona can be supported by evidence of hobbies, social and professional interactions, consumer transactions, employment, etc.  "},{"id":"DTE0016","name":"Decoy Process","description":"Execute software on a target system for the purposes of the defender.","long_description":"Executing software will create a system process (either ephemeral or perpetual) on the target system, which can be used to influence the perception or action of an adversary.   A decoy process could do things including give the impression of either a more or less secure system, the presence of attackable services or defensive infrastructure, or suggest the supposed purpose or use of the target machine."},{"id":"DTE0017","name":"Decoy System","description":"Configure a computing system to serve as an attack target or experimental environment.  ","long_description":"A decoy system is a computing resource presented to the adversary in support of active defense.  The underlying system can be real, virtual, or simulated, and can be presented as one of a variety of IT devices including user workstations, servers, networking systems, IOT (embedded devices), mobile systems like phones, etc."},{"id":"DTE0018","name":"Detonate Malware","description":"Execute malware under controlled conditions to analyze its functionality.","long_description":"An execution environment can range from a somewhat sterile commercial malware execution appliance, to a bespoke system crafted to meet engagement goals.  The execution environment will typically be highly instrumented and have special controls to ensure the experiment is contained and harmless to unrelated systems."},{"id":"DTE0019","name":"Email Manipulation","description":"Modify the flow or contents of email.\n","long_description":"Email flow manipulation includes changing which mail appliances process mail flows, to which systems they forward mail, or moving mail after it arrives in an inbox.  Email content manipulation includes altering the contents of an email message."},{"id":"DTE0020","name":"Hardware Manipulation","description":"Alter the hardware configuration of a system to limit what an adversary can do with the device.","long_description":"Hardware Manipulation can be making physical or configuration changes, including physically removing a system's microphone, camera, on-board Wi-Fi adapter, etc. or using other controls to disable those devices."},{"id":"DTE0021","name":"Hunting","description":"Search for the presence of or information about an adversary, or your organization, its employees, infrastructure, etc.","long_description":"Within the defender's environments, hunting presupposes a failure of initial prevention or detection, and that an adversary has successfully penetrated a system. In this case defenders hunt for the presence of an adversary. Typically the hunt is informed by intelligence on adversary TTPs and infrastructure. Defenders also hunt adversaries outside the defended environment. Information about the adversary, including their skills, TTPs, and infrastructure can be used to improve defenses or promote better adversary engagement. Defenders also hunt for information about their organization that is available for free or for purchase. Actively researching organizational exposure or inclusion in password dumps, leaks, etc. helps defenders focus on specific detections and proactive countermeasures."},{"id":"DTE0022","name":"Isolation","description":"Configure devices, systems, networks, etc. to contain activity and data in order to promote inspection or prevent expanding an engagement beyond desired limits.","long_description":"Using isolation, a defender can prevent potentially malicious activity before it starts or limit its effectiveness and scope. A defender can observe behaviors of adversaries or their tools without exposing them to unintended targets."},{"id":"DTE0023","name":"Migrate Attack Vector","description":"Move a malicious link, file, or device from its intended location to a decoy system or network for execution/use.","long_description":"Migrate Attack Vector allows a defender to access an intercepted malicious element and analyze it in a safe environment or conduct an adversary engagement within a decoy network."},{"id":"DTE0025","name":"Network Diversity","description":"Use a diverse set of devices on the network to help establish the legitimacy of a decoy network.","long_description":"Network diversity involves the use a diverse collection of network items to make a decoy network look more realistic.  It also ensures the network contains the appropriate amount and types of things that would normally be expected, perhaps including networking devices, firewalls, printers, phones, etc. "},{"id":"DTE0026","name":"Network Manipulation","description":"Make changes to network properties and functions to achieve a desired effect.","long_description":"Network Manipulation allows a defender to throttle network speeds, segment the network, maintain a unique IP addressing scheme, or add a kill switch to cut off network access if needed."},{"id":"DTE0027","name":"Network Monitoring","description":"Monitor network traffic in order to detect adversary activity.","long_description":"Network monitoring involves capturing network activity data, including capturing of server, firewall, and other relevant logs. A defender can then review them or send them to a centralized collection location for further analysis."},{"id":"DTE0028","name":"PCAP Collection","description":"Collect full network traffic for future research and analysis.","long_description":"PCAP Collection allows a defenders to use the data to examine an adversary’s network traffic more closely, including studying if it is encoded and/or encrypted. PCAP can be run through tools to replay the traffic to get a real-time view of what happened over the wire. These tools can also parse the traffic and send results to a SIEM for monitoring and alerting."},{"id":"DTE0029","name":"Peripheral Management","description":"Manage peripheral devices used on systems within the network for active defense purposes. \n\n\n","long_description":"Peripheral Management is the administration of peripheral devices used on systems within the network for defensive or deceptive purposes. A defender can choose to allow or deny certain types of peripherals from being used on systems. Defenders can also introduce certain peripherals to an adversary-controlled system to see how the adversary reacts."},{"id":"DTE0030","name":"Pocket Litter","description":"Place data on a system to reinforce the legitimacy of the system or user.","long_description":"Pocket Litter is data placed on a system to convince an adversary that the system and users are real.  Pocket litter includes documents, registry entries, log history, browsing history, connection history, and other user data that one would expect to exist on a user's computer.  This content may overlap with Decoy Content, however Pocket Litter covers aspects beyond just content (e.g.: Installed Applications, source code, clutter on a system, etc.)."},{"id":"DTE0031","name":"Protocol Decoder","description":"Use software designed to deobfuscate or decrypt adversary command and control (C2) or data exfiltration traffic.","long_description":"Protocol decoders are designed to read network traffic and contextualize all activity between the operator and the implant. These tools are often required to process complex encryption ciphers and custom protocols into a human-readable format for an analyst to interpret."},{"id":"DTE0032","name":"Security Controls","description":"Alter security controls to make the system more or less vulnerable to attack.","long_description":"Manipulating security controls involves making configuration changes to the security settings of a system including things like modifying Group Policies, disabling/enabling autorun for removable media, and tightening or relaxing system firewalls, etc."},{"id":"DTE0033","name":"Standard Operating Procedure","description":"Establish a structured way of interacting with systems so that non-standard interactions are more easily detectable.","long_description":"Standard Operating Procedures (SOPs) establish a structured way of interacting with systems and services. These procedures are in place for all users to ensure they can accomplish their goal in the approved manner. If an adversary attempts to perform any tasks which do not conform to the SOP, that activity will be easier to identify, alert on, and respond to."},{"id":"DTE0034","name":"System Activity Monitoring","description":"Collect system activity logs which can reveal adversary activity.","long_description":"Capturing system logs can show logins, user and system events, etc.  Collecting this data and potentially sending it to a centralized location can help reveal the presence of an adversary and the actions they perform on a compromised system."},{"id":"DTE0035","name":"User Training","description":"Train users to detect malicious intent or activity, how to report it, etc.","long_description":"User training involves teaching end users to be human sensors who know how to recognize cyber threats and the procedures for reporting them.  Users can be effective sensors for social engineering attempts, phishing email detection, as well as other cyber threats."},{"id":"DTE0036","name":"Software Manipulation","description":"Make changes to a system's software properties and functions to achieve a desired effect.","long_description":"Software Manipulation allows a defender to alter or replace elements of the operating system, file system, or any other software installed and executed on a system."}]
