[{"id":"DTA0001","name":"Channel","description":"Guide an adversary down a specific path or in a specific direction.","long_description":"Channel is used to guide an adversary down a specific path or in a specific direction.  A defender can channel an adversary away from important systems or network segments and towards decoy systems or hardened devices.  They could also attempt to channel an adversary based on the content that you provide.  Channeling can be used to waste an adversary's time, make them expend additional resources, or allow defenders to study their behaviors."},{"id":"DTA0002","name":"Collect","description":"Gather adversary tools, observe tactics, and collect other raw intelligence about the adversary's activity.","long_description":"Collect is used to gather information about an adversary or their activity that can inform other defenses.  This can include gathering logs that can be used to create detections.  It also includes collecting malware samples that can be used for adversary engagement, hunting, or other purposes."},{"id":"DTA0003","name":"Contain","description":"Prevent an adversary from moving outside specific bounds or constraints.","long_description":"Contain is used to prevent an adversary from moving outside specific bounds or constraints.  This may include preventing them from accessing certain subnets or systems based on where they are operating.  Defenders can also harden systems to prevent them from moving laterally. "},{"id":"DTA0004","name":"Detect","description":"Establish or maintain awareness into what an adversary is doing.","long_description":"Detect is used to establish or maintain awareness into what an adversary is doing.  This could be accomplished by introducing a tripwire that alerts when an adversary touches a system or resource.  It could also be accomplished by using end-point or network  tools."},{"id":"DTA0005","name":"Disrupt","description":"Prevent an adversary from conducting part or all of their mission.","long_description":"Disrupt is used to prevent or discourage an adversary from conducting part or all of their mission.  This may include increasing the time or skills needed to accomplish a specific task or by tightening controls so that more steps need to be taken."},{"id":"DTA0006","name":"Facilitate","description":"Enable an adversary to conduct part or all of their mission.","long_description":"Facilitate is used to enable an adversary to conduct part or all of their mission.  This could include using unpatched versions of operating systems and software, removing end-point detection software,  and using weak password.  It may also include opening firewall ports, adding proxy capabilities, or introducing elements that an adversary can easily leverage to bypass an obstacle in their operations."},{"id":"DTA0007","name":"Legitimize","description":"Add authenticity to deceptive components to convince an adversary that something is real.","long_description":"Legitimize is used to add authenticity to deceptive components to convince an adversary that something is real.  This includes adding realistic user accounts, files, system activity, and any other content that an adversary might expect to see.  "},{"id":"DTA0008","name":"Test","description":"Determine the  interests, capabilities, or behaviors of an adversary.","long_description":"Test is used to determine an adversary's interests, capabilities, behaviors, motivations, etc.  This may include things like providing systems to see if an adversary engages or providing content to see if the adversary inspects or exfiltrates it. You can also test an adversary by making a tasks more difficult to perform and see if they have the capabilities to accomplish it."}]
