[{"id":"DPR0001","description":"Remove an account's administrative access from a system or service to require an adversary to reveal techniques for elevating privileges in order to accomplish certain tasks."},{"id":"DPR0002","description":"Grant an account administrative access to a system or service to enable an adversary to take advantage of those privileges if they compromise the system or service."},{"id":"DPR0003","description":"Hook the Win32 Sleep() function so that it always performs a Sleep(1) instead of the intended duration. This can increase the speed at which dynamic analysis can be performed when a normal malicious file sleeps for long periods before attempting additional capabilities."},{"id":"DPR0004","description":"Hook the Win32 NetUserChangePassword() and modify it such that the new password is different from the one provided. The data passed into the function is encrypted along with the modified new password, then logged so a defender can get alerted about the change as well as decrypt the new password for use."},{"id":"DPR0005","description":"Trace activity through WinSock TCP API functions to view potentially  malicious network events. Log it such that it can be pushed to a centralized location and analyzed further."},{"id":"DPR0006","description":"Hook the Win32 DeleteFile() function to log all attempts at deleting a given file. This information can be used to trigger restoration attempts on critical data, reducing potential disruption if those files are unavailable for prolonged periods of time."},{"id":"DPR0007","description":"Use a mix of vulnerable and nonvulnerable software on a system to allow you to see what exploits the adversary leverages in their attacks."},{"id":"DPR0008","description":"Install Anti-virus or other end-point detection tools on systems to see if an adversary takes note of them and if so, how they react."},{"id":"DPR0009","description":"Backup data on public facing websites and retain the files offline. In the event of data damage or loss, restore the data from backup."},{"id":"DPR0010","description":"Backup data on an end-user system and store offline.  If an adversary alters or deletes data on the system, restore the data using the backup copy."},{"id":"DPR0011","description":"Maintain a verified baseline firewall configuration and use that copy as a fallback if an adversary alters that information."},{"id":"DPR0012","description":"Maintain a verified list of group policies enforced on a system and use that copy if an adversary attempts to deviate from the baseline."},{"id":"DPR0013","description":"Use behavioral analytics to detect Living Off The Land Binaries (LOLBins) being used to download and execute a file."},{"id":"DPR0014","description":"Use behavioral analytics to identify a system running development tools, but is not used by someone who does development."},{"id":"DPR0015","description":"Use behavioral analytics to identify abnormal system processes being used to launch a different process."},{"id":"DPR0016","description":"Configure a decoy system and allow it to be used in an manner such that it collects activity logs and appears to be to be a legitimate system."},{"id":"DPR0017","description":"Configure a system to generate internet browser traffic for a decoy user profile, creating artifacts such as cookies, history, temp files, etc."},{"id":"DPR0018","description":"Alter the output of an adversary's profiling commands to make newly-built systems look like the operating system was installed months earlier."},{"id":"DPR0019","description":"Alter the output of adversary recon commands to not show important assets, such as a file server containing sensitive data."},{"id":"DPR0020","description":"Create a user account with a specified job function. Populate the user account's groups, description, logon hours, etc., with decoy data that looks normal in the environment."},{"id":"DPR0021","description":"Create a user that has a valid email account.  Use this account in such a way that the email address could be harvested by the adversary. This can be monitored to see if it is used in future attacks."},{"id":"DPR0022","description":"Create directories and files with names and contents using key words that may be relevant to an adversary to see if they examine or exfiltrate the data."},{"id":"DPR0023","description":"Seed a file system with content that is of no value to the company but reinforces the legitimacy of the system if viewed by an adversary."},{"id":"DPR0024","description":"Create user credentials for a decoy account, such as 'User ABC'.  Store those credentials in the browser and other places on the system to see if an adversary attempts to harvest them."},{"id":"DPR0025","description":"Use a Windows Virtual Machine (VM) and a Mac VM to visit a malicious website and note any differences in how the site functions based on the client that was used."},{"id":"DPR0026","description":"Deploy multiple decoy systems, each with a unique network fingerprint (ports, services, connections, etc.) in order to provide an adversary a wide range of targets."},{"id":"DPR0027","description":"Create an isolated network populated with decoy systems that can be used to study an adversary's tactics, techniques, and procedures (TTPs)."},{"id":"DPR0028","description":"Use a segregated network to visit a compromised site.  If the machine becomes infected, allow the machine to remain on with internet access to see if an adversary engages and takes action on the system."},{"id":"DPR0029","description":"Create a persona that represents an employee with hobbies, outside interests, personal accounts, etc.  This persona may be used in conjunction with decoy accounts and credentials."},{"id":"DPR0030","description":"Create a persona that represents an employee's projects and job scope. This persona information can be leveraged in conjunction with Burn-In and Pocket Litter."},{"id":"DPR0031","description":"Create decoy processes on a system that mimic common antivirus process names. These processes when seen may prevent adversary malware from executing for fear of detection."},{"id":"DPR0032","description":"Use an isolated system to visit a suspected compromised website.  Collect any associated scripting code or files dropped onto the system."},{"id":"DPR0033","description":"Setup a server which appears to be something that is commonly expected within a network, such as web server."},{"id":"DPR0034","description":"Take malware received via spearphishing and detonate it on an isolated system in order to collect execution and network communication artifacts."},{"id":"DPR0035","description":"Detonate a malware sample in a decoy network to engage with an adversary and study their TTPs."},{"id":"DPR0036","description":"Modify the destination of inbound email to facilitate the collection of inbound spearphishing messages."},{"id":"DPR0037","description":"Remove the microphone from a laptop to prevent an adversary from capturing audio from the device."},{"id":"DPR0038","description":"Remove the Wi-Fi hardware from a device to prevent an adversary from enabling and using  a Wi-Fi connection."},{"id":"DPR0039","description":"Pivot on Command and Control information to identify other infrastructure used by the same adversary."},{"id":"DPR0040","description":"Unplug an infected system from the network and disable any other means of communication."},{"id":"DPR0041","description":"When malware is received via spearphishing, move the email message onto a decoy system prior to detonating the malicious file attachment."},{"id":"DPR0043","description":"Deploy a mix of network devices (systems, servers, printers, phones, etc.) to make a decoy network look realistic."},{"id":"DPR0044","description":"Deploy a variety of systems which reflect the use of multiple operating systems, hardware platforms, network services, etc."},{"id":"DPR0045","description":"Add a kill switch to a decoy network that can be used to shutdown all network communication if an adversary takes an action that is out of the desired scope."},{"id":"DPR0046","description":"Introduce intermittent network packet loss on a decoy network to interfere with an adversary's activities."},{"id":"DPR0047","description":"Capture network logs for internet-facing devices and send those logs to a central collection location."},{"id":"DPR0048","description":"Capture all network  device (router, switches, proxy, etc.) logs on a decoy network and send those logs to a central collection location."},{"id":"DPR0049","description":"Collect PCAP on a decoy network to improve visibility into an adversary's network activity."},{"id":"DPR0050","description":"Introduce external devices (e.g. a USB drive) to a machine in an adversary engagement scenario to see how quickly an adversary gains awareness to its presence and if they attempt to leverage the device."},{"id":"DPR0051","description":"Configure controls (such as AutoRun) which would require an adversary to take additional steps when leveraging a peripheral device to execute their tools."},{"id":"DPR0052","description":"When staging a decoy system and user account, populate a user's folders and web history to make it look realistic to an adversary."},{"id":"DPR0053","description":"Stage a USB device with documents on a specific topic in order to see if they are exfiltrated by an adversary."},{"id":"DPR0054","description":"Create and apply a decoder which allows you to view encrypted and/or encoded network traffic in a human-readable format."},{"id":"DPR0055","description":"Weaken security controls on a system to allow for leaking of credentials via network connection poisoning."},{"id":"DPR0056","description":"Implement policies on a system to prevent the insecure storage of passwords in the registry. This may force an adversary to revert these changes or find another way to access cached credentials."},{"id":"DPR0057","description":"Require approvals and waivers for users to make changes to their system which requires administrative access. Any changes not made through this process are suspect and immediately investigated as malicious activity."},{"id":"DPR0058","description":"Create a development library that all users must leverage in order to interact with any hosted databases. This library modifies queries to look difficult to write. Any queries made without the library will now be obvious to detect and are immediately investigated as malicious activity."},{"id":"DPR0059","description":"Ensure that systems capture and retain common system level activity artifacts that might be produced."},{"id":"DPR0060","description":"Monitor Windows systems for event codes that reflect an adversary changing passwords, adding accounts to groups, etc."},{"id":"DPR0061","description":"Train users to immediately report suspicious emails.  Those emails could then be used for malware detonation or adversary engagement purposes."},{"id":"DPR0062","description":"Train users to report potentially compromised devices so they can be isolated or migrated into deception networks."},{"id":"DPR0063","description":"In an adversary engagement situation, if an adversary deletes or alters files on a machine they are controlling, restore the data to it original state and location to see how the adversary reacts."},{"id":"DPR0064","description":"Modify the contents of an email message to maintain continuity when it is used for adversary engagement purposes."},{"id":"DPR0065","description":"Use information about an adversary's TTPs to perform retroactive searches for any activity that have gone undetected."},{"id":"DPR0066","description":"Run all user applications in isolated containers to prevent a compromise from expanding beyond the container's boundaries."}]
