[{"id":"DOS0001","description":"There is an opportunity to study the adversary and collect first-hand observations about them and their tools."},{"id":"DOS0002","description":"There is an opportunity to discover who or what is being targeting by an adversary."},{"id":"DOS0003","description":"There is an opportunity to use a compromised drive-by site to start long term engagement with the adversary and observe the adversary's post-exploit TTPs."},{"id":"DOS0004","description":"There is an opportunity to introduce user accounts that are used to make a system look more realistic."},{"id":"DOS0005","description":"There is an opportunity to deploy a tripwire that triggers an alert when an adversary touches a network resource or uses a specific technique."},{"id":"DOS0006","description":"There is an opportunity to prepare user accounts so they look used and authentic."},{"id":"DOS0008","description":"There is an opportunity to present several public-facing application options to see what application(s)  the adversary targets."},{"id":"DOS0009","description":"There is an opportunity to determine if an adversary already has valid account credentials for your network and if they are trying to use them access your network via remote services."},{"id":"DOS0010","description":"There is an opportunity to test hardware additions in an isolated environment and ensure they can't be used by an adversary."},{"id":"DOS0012","description":"There is an opportunity to prevent an adversary from using removable media to compromise disconnected or air-gapped systems."},{"id":"DOS0013","description":"There is an opportunity to study removable media to see if it's infected and what happens when it is plugged into a decoy system or network."},{"id":"DOS0015","description":"There is an opportunity to use tools and controls to stop an adversary's activity."},{"id":"DOS0016","description":"There is an opportunity to use security controls to stop or allow an adversary's activity."},{"id":"DOS0017","description":"A phishing email can be detected and blocked from arriving at the intended recipient.  "},{"id":"DOS0018","description":"Users trained and encouraged to report phishing can detect attacks that other defenses do not."},{"id":"DOS0019","description":"A phishing email can be detected and moved from the intended recipient to a decoy account for reading and execution."},{"id":"DOS0020","description":"Hardware and/or software additions can be tested and verified in controlled environments prior to deployment."},{"id":"DOS0021","description":"When authorized behavior is defined and limited for trusted partners, adversaries exploiting trust relationships are easier to detect."},{"id":"DOS0023","description":"There is an opportunity to gauge an adversary's interest in connected peripheral devices."},{"id":"DOS0024","description":"There is an opportunity to determine adversary capabilities or preferences by controlling aspects of the engagement environment."},{"id":"DOS0026","description":"In an adversary engagement operation, there is an opportunity to impact what an adversary sees when they execute commands on a system."},{"id":"DOS0027","description":"There is an opportunity to create a detection with a moderately high probability of success."},{"id":"DOS0028","description":"There is an opportunity for the defender to observe the adversary and control what they can see, what effects they can have, and/or what data they can access."},{"id":"DOS0029","description":"There is an opportunity to block an adversary's intended action and force them to reveal additional TTPs."},{"id":"DOS0051","description":"There is an opportunity to utilize confirmed good copies of login scripts and restoring on a frequent basis to prevent an adversary from using them to launch malware on a recurring basis."},{"id":"DOS0058","description":"Although adversaries may attempt to delete or change important artifacts,  there may be a window of time to retrieve them before that happens."},{"id":"DOS0069","description":"There is an opportunity to utilize known good copies of registry information and restore it if an adversary makes any changes."},{"id":"DOS0074","description":"There is an opportunity to influence an adversary to move toward systems you want them to engage with."},{"id":"DOS0076","description":"In an adversary engagement situation, there is an opportunity to add legitimacy by ensuring decoy systems are fully populated with information an adversary would expect to see during this recon process."},{"id":"DOS0081","description":"There is an opportunity to entice the adversary to expose additional TTPs."},{"id":"DOS0082","description":"There is an opportunity to introduce data to an adversary to influence their future behaviors."},{"id":"DOS0084","description":"In order to prolong an adversary engagement operation or enable detections, there is an opportunity to introduce credentials to an adversary that you want them to collect and use."},{"id":"DOS0085","description":"In an adversary engagement scenario, there is an opportunity to use a variety of applications on a system to see what an adversary tries to exploit in order to acquire credentials."},{"id":"DOS0087","description":"In an adversary engagement scenario, there is an opportunity to test whether an adversary has the capability to steal or forge Kerberos tickets."},{"id":"DOS0091","description":"Users trained and encouraged to report unsolicited application authorization requests can detect attacks that other defenses do not."},{"id":"DOS0093","description":"There is an opportunity to seed systems with decoy cookies that will lead adversaries to decoy targets."},{"id":"DOS0095","description":"There is an opportunity to detect an adversary's activity if they are unable to follow a company's documented standard operating procedures."},{"id":"DOS0098","description":"In an adversary engagement scenario, there is an opportunity to seed content to influence an adversary's behaviors, test their interest in specific topics, or add legitimacy to a system or environment."},{"id":"DOS0099","description":"In an adversary engagement scenario, there is an opportunity provide content on a variety of topics to see what types of information seems to interest the adversary."},{"id":"DOS0106","description":"There is an opportunity to alter the system to prevent an adversary from capturing audio content."},{"id":"DOS0112","description":"In an adversary engagement scenario, there is an opportunity to prepare a user's browser data (sessions, cookies, etc.) so it looks authentic and fully populated."},{"id":"DOS0115","description":"There is an opportunity to alter the system to prevent an adversary from capturing video content."},{"id":"DOS0116","description":"There is an opportunity to detect adversary activity that uses obfuscated communication."},{"id":"DOS0118","description":"There is an opportunity to test what an adversary might do if destroyed data is selectively replaced by the defender."},{"id":"DOS0122","description":"There is an opportunity to test what an adversary might do if encrypted data is selectively replaced by the defender."},{"id":"DOS0123","description":"There is an opportunity to detect an adversary who modifies website content (internally or externally) by monitoring for unauthorized changes to websites."},{"id":"DOS0124","description":"There is an opportunity to disrupt an adversary's defacement activity by quickly restoring altered content."},{"id":"DOS0130","description":"There is an opportunity to alter the network configuration in order to disrupt an adversary who is trying to saturate the network or a system via denial of service."},{"id":"DOS0131","description":"There is an opportunity to detect the presence of an adversary by identifying and alerting on anomalous behaviors."},{"id":"DOS0133","description":"In an adversary engagement scenario, there is an opportunity  to observe how an adversary might manipulate data on a system."},{"id":"DOS0137","description":"There is an opportunity to implement security controls which will prevent an adversary from using Windows Management Instrumentation (WMI), in order to entice them to reveal new TTPs."},{"id":"DOS0140","description":"There is an opportunity to use security controls on systems in order to affect the success of an adversary."},{"id":"DOS0141","description":"There is an opportunity to monitor logs on a system for common ways adversaries behave and detect on that activity."},{"id":"DOS0146","description":"In an adversary engagement scenario, there is an opportunity to implement security controls to support your defensive objectives over a prolonged engagement."},{"id":"DOS0147","description":"In an adversary engagement scenario, there is an opportunity to allow or restrict admin access to support your defensive objectives."},{"id":"DOS0148","description":"In an adversary engagement scenario, there is an opportunity to implement security controls to allow an adversary to accomplish a task and extend an engagement."},{"id":"DOS0159","description":"There is an opportunity to manipulate the network to allow/deny certain types of traffic, to degrade network traffic, or otherwise impact an adversary's activity."},{"id":"DOS0160","description":"There is an opportunity to detect an unknown process that is being used for command and control and disrupt it."},{"id":"DOS0164","description":"There is an opportunity to block an adversary that is seeking to use a proxied connection."},{"id":"DOS0165","description":"In an adversary engagement scenario, there is an opportunity to add legitimacy by ensuring the local system is with fully populated with content."},{"id":"DOS0169","description":"There is an opportunity to deploy virtual decoy systems and see if an adversary discovers or reacts to the virtualization."},{"id":"DOS0170","description":"There is an opportunity to collect network data and analyze the adversary activity it contains."},{"id":"DOS0174","description":"There is an opportunity to disrupt or enable and adversary's exfiltration activities by blocking/unblocking the traffic to their Command and Control (C2) location."},{"id":"DOS0180","description":"There is an opportunity to provide a variety of applications to an adversary so they see a full set of information when performing discovery tasks."},{"id":"DOS0182","description":"There is an opportunity to present decoy processes to an adversary to influence their behaviors, test their interest, or add legitimacy to a system or environment."},{"id":"DOS0187","description":"In an adversary engagement operation, there is an opportunity to present decoy accounts to the adversary during the enumeration process."},{"id":"DOS0188","description":"There is an opportunity to use decoy accounts of varying types to see what an adversary is most interested in."},{"id":"DOS0190","description":"In an adversary engagement scenario, there is an opportunity to introduce decoy content to entice additional engagement activity."},{"id":"DOS0191","description":" There is an opportunity to supply a variety of different decoy network shares to an adversary to see what they are drawn to look at and use."},{"id":"DOS0198","description":"There is an opportunity to monitor network traffic for different protocols, anomalous traffic patterns, transfer of data, etc. to determine the presence of an adversary."},{"id":"DOS0199","description":"In an adversary engagement scenario, there is an opportunity to introduce decoy systems that can influence an adversary's behavior or allow you to observe how they perform a specific task."},{"id":"DOS0210","description":"There is an opportunity to feed content to an adversary to influence their behaviors, test their interest in specific topics, or add legitimacy to a system or environment."},{"id":"DOS0219","description":"There is an opportunity to provide a variety of applications to an adversary to see what things an adversary prefers or to influence their operations."},{"id":"DOS0231","description":"There is an opportunity to extend an adversary's engagement period by creating a decoy network that systems can discover when performing trust discovery."},{"id":"DOS0234","description":"There is an opportunity to seed decoy content to make non-virtual systems look like virtual systems to see how an adversary reacts."},{"id":"DOS0245","description":"If you can determine how an adversary is dynamically resolving command and control (C2) addresses, there is an opportunity to use that information to identify additional adversary infrastructure or tools."},{"id":"DOS0246","description":"An adversary may attempt to dynamically determine the C2 address to communicate with. This gives a defender an opportunity to discover additional infrastructure."},{"id":"DOS0249","description":"There is an opportunity to reveal data that the adversary has tried to protect from defenders"},{"id":"DOS0251","description":"There is an opportunity to introduce services in a decoy network to determine if an adversary notices and tries to learn more about them."},{"id":"DOS0252","description":"There is an opportunity to gain visibility into newly created or previously unknown adversary infrastructure"},{"id":"DOS0253","description":"There is an opportunity to introduce decoy information, users, systems, etc. to influence an adversary's future actions."}]
